In [ ]:
#DATA AGGREGATION AND GROUPING

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Dataset.csv')

In [3]:
df.head()

   Sales-Date Category Region        Product  Sales    Value
0  2024-11-03    Books   East        Mystery   50.0  3128.77
1  2024-01-31    Books   East         Sci-Fi   95.0   754.56
2  2024-12-15   Sports  North     Basketball   84.0  1079.05
3  2024-02-13   Sports   East  Tennis Racket    9.0  4041.48
4  2024-09-04  Apparel   West        T-Shirt   52.0   335.19

In [4]:
# Group by Product and Tell by each product the value by mean
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Basketball        2689.975000
Biography         2078.170000
Blender           1098.580000
Coffee Maker      1440.380000
Dress             3005.830000
Dumbbells         2095.402500
Fiction           2696.496667
Football          2017.426667
Headphones        4598.480000
Jacket            1665.470000
Laptop             534.407500
Mystery           1782.370000
Non-Fiction       1013.830000
Sci-Fi            1127.130000
Smartwatch        2973.217500
Sneakers          2975.295000
T-Shirt           1806.117500
Tablet            2031.165000
Tennis Racket     2233.065000
Vacuum Cleaner    1593.430000
Yoga Mat          1385.860000
Name: Value, dtype: float64

In [5]:
# Total sale based on Product and Region
total_sale = df.groupby(['Product','Region'])['Sales'].sum()
print(total_sale)

Product         Region
Basketball      East        42.0
                North       84.0
Biography       Central     76.0
Blender         Central    108.0
Coffee Maker    West        79.0
Dress           North       17.0
Dumbbells       East        58.0
                North       91.0
                South       87.0
                West        84.0
Fiction         Central    120.0
                North       68.0
Football        South       52.0
                West       113.0
Headphones      North       38.0
Jacket          Central     18.0
                North       82.0
Laptop          Central     86.0
                North       84.0
                West        46.0
Mystery         Central     52.0
                East        50.0
                North       18.0
                West        12.0
Non-Fiction     East        85.0
Sci-Fi          East        95.0
                South       98.0
Smartwatch      East        82.0
                North       42.0
                West         4.0
Sneakers        West        61.0
T-Shirt         Central     26.0
                East        96.0
                South       94.0
                West        52.0
Tablet          Central     96.0
Tennis Racket   East        94.0
Vacuum Cleaner  East       100.0
Yoga Mat        Central     87.0
Name: Sales, dtype: float64

In [6]:
# Apply multiple agg function
grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count'])
print(grouped_agg)

                mean       sum  count
Region
Central  1774.348333  21292.18     12
East     2455.139000  24551.39     10
North    1938.275000  23259.30     12
South    1605.415000   6421.66      4
West     1980.611000  19806.11     10

In [14]:
#MERGING AND JOINING DATAFRAMES
#sample dataframe
df1 = pd.DataFrame({'Key':['A','B','C'],'Value1':['1','2','3']})
df2 = pd.DataFrame({'Key':['A','B','D'],'Value2':['4','5','6']})

In [15]:
df1
df2

  Key Value2
0   A      4
1   B      5
2   D      6

In [16]:
#Merge DF on based on Key Column
pd.merge(df1,df2,on='Key',how='inner')

  Key Value1 Value2
0   A      1      4
1   B      2      5

In [17]:
pd.merge(df1,df2,on='Key',how='outer')

  Key Value1 Value2
0   A      1      4
1   B      2      5
2   C      3    NaN
3   D    NaN      6

In [18]:
pd.merge(df1,df2,on='Key',how='left')

  Key Value1 Value2
0   A      1      4
1   B      2      5
2   C      3    NaN